package com.redshield.envlope.constant;

/*************************************************************************
 ******
 * - Copyright (c) 2021 redshield.com
 * - File Name: TypeEnum
 * - @Author: WangJiLIn
 * - Description:
 * 接⼝描述
 * - Functions:
 *
 * - History:
 * Date        Author          Modification
 * 2021/4/7   WangJiLin     Create the current class
 *************************************************************************
 ******/
public enum  TypeEnum {
    北京("110000","北京"),
    天津("120000","天津"),
    河北("130000","河北"),
    山西("140000","山西"),
    内蒙("150000","内蒙古"),
    辽宁("210000","辽宁"),
    吉林("220000","吉林"),
    黑龙("230000","黑龙江"),
    上海("310000","上海"),
    江苏("320000","江苏"),
    浙江("330000","浙江"),
    安徽("340000","安徽"),
    福建("350000","福建"),
    江西("360000","江西"),
    山东("370000","山东"),
    河南("410000","河南"),
    湖北("420000","湖北"),
    湖南("430000","湖南"),
    珠海("440000","珠海"),
    广州("440100","广州"),
    深圳("440300","深圳"),
    广西("450000","广西"),
    海南("460000","海南"),
    重庆("500000","重庆"),
    四川("510000","四川"),
    贵州("520000","贵州"),
    云南("530000","云南"),
    西藏("540000","西藏"),
    陕西("610000","陕西"),
    甘肃("620000","甘肃"),
    青海("630000","青海"),
    宁夏("640000","宁夏"),
    新疆("650000","新疆");

    private String type;
    private String areacode;

    TypeEnum(String areacode,String type) {
        this.type = type;
        this.areacode = areacode;
    }
    public String getType(){
        return type;
    }
    public String getAreacode(){
        return areacode;
    }
}
