package com.redshield.envlope.constant;

/*************************************************************************
 ******
 * - Copyright (c) 2021 redshield.com
 * - File Name: TypeEnum
 * - @Author: WangJiLIn
 * - Description:
 * 接⼝描述
 * - Functions:
 *
 * - History:
 * Date        Author          Modification
 * 2021/4/7   WangJiLin     Create the current class
 *************************************************************************
 ******/
public enum  TypeEnum {
    北京_110000("110000","北京"),
    天津_120000("120000","天津"),
    河北_130000("130000","河北"),
    山西_140000("140000","山西"),
    内蒙_150000("150000","内蒙古"),
    辽宁_210000("210000","辽宁"),
    吉林_220000("220000","吉林"),
    黑龙_230000("230000","黑龙江"),
    上海_310000("310000","上海"),
    江苏_320000("320000","江苏"),
    浙江_330000("330000","浙江"),
    安徽_340000("340000","安徽"),
    福建_350000("350000","福建"),
    江西_360000("360000","江西"),
    山东_370000("370000","山东"),
    河南_410000("410000","河南"),
    湖北_420000("420000","湖北"),
    湖南_430000("430000","湖南"),
    珠海_440000("440000","珠海"),
    广州_440100("440100","广州"),
    深圳_440300("440300","深圳"),
    广西_450000("450000","广西"),
    海南_460000("460000","海南"),
    重庆_500000("500000","重庆"),
    四川_510000("510000","四川"),
    贵州_520000("520000","贵州"),
    云南_530000("530000","云南"),
    西藏_540000("540000","西藏"),
    陕西_610000("610000","陕西"),
    甘肃_620000("620000","甘肃"),
    青海_630000("630000","青海"),
    宁夏_640000("640000","宁夏"),
    新疆_650000("650000","新疆");

    private String type;
    private String areacode;

    TypeEnum(String areacode,String type) {
        this.type = type;
        this.areacode = areacode;
    }
    public String getType(){
        return type;
    }
    public String getAreacode(){
        return areacode;
    }
}
